/**
 *               ii.                                         ;9ABH,
 *              SA391,                                    .r9GG35&G
 *              &#ii13Gh;                               i3X31i;:,rB1
 *              iMs,:,i5895,                         .5G91:,:;:s1:8A
 *               33::::,,;5G5,                     ,58Si,,:::,sHX;iH1
 *                Sr.,:;rs13BBX35hh11511h5Shhh5S3GAXS:.,,::,,1AG3i,GG
 *                .G51S511sr;;iiiishS8G89Shsrrsh59S;.,,,,,..5A85Si,h8
 *               :SB9s:,............................,,,.,,,SASh53h,1G.
 *            .r18S;..,,,,,,,,,,,,,,,,,,,,,,,,,,,,,....,,.1H315199,rX,
 *          ;S89s,..,,,,,,,,,,,,,,,,,,,,,,,....,,.......,,,;r1ShS8,;Xi
 *        i55s:.........,,,,,,,,,,,,,,,,.,,,......,.....,,....r9&5.:X1
 *       59;.....,.     .,,,,,,,,,,,...        .............,..:1;.:&s
 *      s8,..;53S5S3s.   .,,,,,,,.,..      i15S5h1:.........,,,..,,:99
 *      93.:39s:rSGB@A;  ..,,,,.....    .SG3hhh9G&BGi..,,,,,,,,,,,,.,83
 *      G5.G8  9#@@@@@X. .,,,,,,.....  iA9,.S&B###@@Mr...,,,,,,,,..,.;Xh
 *      Gs.X8 S@@@@@@@B:..,,,,,,,,,,. rA1 ,A@@@@@@@@@H:........,,,,,,.iX:
 *     ;9. ,8A#@@@@@@#5,.,,,,,,,,,... 9A. 8@@@@@@@@@@M;    ....,,,,,,,,S8
 *     X3    iS8XAHH8s.,,,,,,,,,,...,..58hH@@@@@@@@@Hs       ...,,,,,,,:Gs
 *    r8,        ,,,...,,,,,,,,,,.....  ,h8XABMMHX3r.          .,,,,,,,.rX:
 *   :9, .    .:,..,:;;;::,.,,,,,..          .,,.               ..,,,,,,.59
 *  .Si      ,:.i8HBMMMMMB&5,....                    .            .,,,,,.sMr
 *  SS       :: h@@@@@@@@@@#; .                     ...  .         ..,,,,iM5
 *  91  .    ;:.,1&@@@@@@MXs.                            .          .,,:,:&S
 *  hS ....  .:;,,,i3MMS1;..,..... .  .     ...                     ..,:,.99
 *  ,8; ..... .,:,..,8Ms:;,,,...                                     .,::.83
 *   s&: ....  .sS553B@@HX3s;,.    .,;13h.                            .:::&1
 *    SXr  .  ...;s3G99XA&X88Shss11155hi.                             ,;:h&,
 *     iH8:  . ..   ,;iiii;,::,,,,,.                                 .;irHA
 *      ,8X5;   .     .......                                       ,;iihS8Gi
 *         1831,                                                 .,;irrrrrs&@
 *           ;5A8r.                                            .:;iiiiirrss1H
 *             :X@H3s.......                                .,:;iii;iiiiirsrh
 *              r#h:;,...,,.. .,,:;;;;;:::,...              .:;;;;;;iiiirrss1
 *             ,M8 ..,....,.....,,::::::,,...         .     .,;;;iiiiiirss11h
 *             8B;.,,,,,,,.,.....          .           ..   .:;;;;iirrsss111h
 *            i@5,:::,,,,,,,,.... .                   . .:::;;;;;irrrss111111
 *            9Bi,:,,,,......                        ..r91;;;;;iirrsss1ss1111

Matt去发快递，快递点有N个职员，职员处理一个客户的时间服从指数分布：,
其中的参数为职员的效率，现在给出每个职员的效率，同时给了一个场景：
现在每个职员都有且只有客户在服务中，此人还从信息牌得知了
每个职员已经为当前客户服务了c时间，题目中也给出了，
一旦有客户被服务完毕，则这个人就立刻去接受服务。
问在此场景下，这个人发快递需要的时间的期望是多少？
 一个人到邮局寄东西。一共有n个工作人员。
 而每个工作人员前正有一个人正在邮局东西。
 已知第i工作人员处理一个人的业务用时为t的概率p(t)=ki*e^(-ki*t).
 现在问你这个人从等待到寄完自己的东西用的时间的期望。
 */
#include<bits/stdc++.h>
#define ll long long
using namespace std;
const int maxx = 1010;
const ll mod = (ll)1e9+7;

int a[200200];

int main()
{
	int T;
	scanf("%d",&T);
	int tc = 1;
	while(T--)
	{
		
		int n,m,l;
		a[0] = 0;
		scanf("%d%d%d",&n,&m,&l);
		for(int i = 1;i <= n;i++ )
		{
			scanf("%d",&a[i]);
		}
		a[n+1] = m;
		sort(a,a+n+2);
		
		int ans = 0;
		int pre = -1000000;
		int now = 0;
		int i = 1;
		while(now < m)
		{
			if((a[i] - now)<=l)
			{
				i = upper_bound(a,a+n+2,now+l) - a;
				ans++;
				pre = now;
				now = a[i-1];
//				printf("now %d pre %d i %d\n ",now,pre,i);
				
			}
			else
			{
				 int w=(a[i]-now)/(l+1)-1;      
                if(w>0)  
                {  
                    int t=max(now+1,pre+l+1);  
                    pre=t+(w-1)*(l+1);  
                    now+=w*(l+1);  
                    ans+=w*2;  
                }  
                else  
                {  
                    int t=max(now+1,pre+l+1);  
                    pre=now;  
                    now=t;  
                    ans++;  
                }  
			}
		}
		
		
		
		printf("Case #%d: %d\n",tc++,ans);
	 } 

/*
2

4
1 1
2 2
3 3
4 4
10
0
10
8
12
100
10000

4
1 4
2 3
3 2
4 1
10
0
10
5
100000



5
1 1
3 1
5 1
7 1
9 1
10
0 2 4 6 8 10


16
10 10
20 20
30 30
40 40
50 40 
60 30 
70 20
80 10
110 10
120 20
130 30
140 40
150 40 
160 30 
170 20
180 10

10 
0

100





*/


 return 0;
}


